// import Img_1 from '@/assets/home/Hero/1.png'
// import Img_2 from '@/assets/home/Hero/2.png'
// import Img_3 from '@/assets/home/Hero/3.png'
// import Img_4 from '@/assets/home/Hero/4.png'

export default {
    selectRegion: 'اختر المنطقة',
    verifyEmail: 'تم إرسال بريد التحقق إلى صندوق الوارد الخاص بك',
    notification: 'تم إرسال معلوماتك بنجاح.',
    notification_err: 'يرجى إعادة إرسال البيانات.',
    resendEmailButton: 'إعادة إرسال بريد التحقق',
    emailVerificationTitle: 'تأكيد البريد الإلكتروني',
    messageVerfied: 'تم تأكيد بريدك الإلكتروني بنجاح! مرحبًا بك في Soomha!',
    emailVerificationMessage: 'لقد أرسلنا بريد تحقق إلى صندوق الوارد الخاص بك. يرجى التحقق من بريدك الإلكتروني لتأكيد حسابك.',
    emailVerificationSpamNote: 'إذا لم تستلم البريد الإلكتروني، يرجى التحقق من مجلد الرسائل غير المرغوب فيها (Spam).',
    loginButton: 'تسجيل الدخول',
    searchHere: 'ابحث هنا...',
    evalute_id: 'قيمها قبل ان تذهب لسمسار يبخسها ',
    getValue: 'احصل على القيمة قبل ان تذهب غنيمه',

    newModel: 'اكتب موديل جديد',
    terms2: 'الشروط',
    and: 'و',
    the: '',
    conditions: 'الأحكام',
    verification: {
        success: 'تم التحقق من بريدك الإلكتروني بنجاح!',
        error: 'رابط التحقق غير صالح.',
    },
    terms: 'يجب قبول الشروط والأحكام للمتابعة.',
    lang: 'ar',
    navbar2: {
        box1: [
            { path: '/', name: 'الرئيسية' },
            { path: '/services', name: 'خدماتنا' },
            { path: '/numbers', name: 'سومها بالارقام' },
            { path: '/ads', name: 'لاعلاناتكم' },
            { path: '/contact-us', name: 'تواصل معنا' },
            { path: '/offers', name: 'باقات تقييم السيارات' },
        ],
        nav1: 'حسابي',
        nav2: 'طلباتي',
        nav3: 'تسجيل خروج',

        button: 'تسجيل الدخول',
    },

    home: {
        // "imgs" : [Img_1 ,Img_2 ,Img_3 ,Img_4],
        text: [
            { h1: 'قيمها قبل ان تذهب لسمسار يبخسها', h2: 'افراد - بنوك - شركات' },
            { h1: '', h2: 'افراد - بنوك - شركات' },
            { h1: 'احصل على القيمة قبل ان تذهب غنيمه', h2: 'افراد - بنوك - شركات' },
            { h1: '', h2: 'افراد - بنوك - شركات' },
        ],
        btns: ['تقييم السيارات للشركات', 'تقييم السيارات للبنوك', 'تقييم السيارات للأفراد'],

        brand: ['سومها المستقبل', 'معكم سنصل الى مكان يجمع كل ما يخص السيارات ، انتظرو كل ما هو جديد'],
        adds: 'لتقييم السيارات الفارهة والغير موجوده في النظام يرجي التواصل معنا عبر <b>(واتس اب او بريد الكتروني) </b> وسيتم التعامل مع المعلومات بكل سريه وخصوصية كاملة, علما ان هذه الخدمة ستكون مدفوعه الاجر بسعر مخفض لفتره محدوده  ',
        news: ['الأخبار و الأحداث', 'كن على متابعة بآخر الأخبار و الأحداث المتعلقة بسومها أول بأول ', 'قراءة المزيد', 'عرض الكل'],
        common: ['الأسئلة الشائعة'],
    },

    services: {
        breadCrumbs: ['الرئيسية', 'خدماتنا'],
        h1: 'نحن فريق سومها',
        h2: 'نقدم لكم خبراتنا للحصول على تقييم اقرب للدقة',
        h3: 'يخلو من المبالغة في القيمة دون ادنى مسوؤليه ماديه او معنوية او قانونية على المنصة',
        soon: 'soon_ar',
        box: [
            {
                path: '/evaluate/people',
                title: 'تقييم السيارات للأفراد',
                icon: (
                    <svg width='72' height='72' viewBox='0 0 72 72' fill='none' xmlns='http://www.w3.org/2000/svg'>
                        {' '}
                        <path d='M61.4531 37.7089H54.4053C53.4461 37.7089 52.5174 37.8399 51.6336 38.081C49.8901 34.6537 46.3306 32.2988 42.229 32.2988H29.771C25.6694 32.2988 22.1099 34.6537 20.3664 38.081C19.4632 37.8341 18.5311 37.709 17.5947 37.7089H10.5469C4.73133 37.7089 0 42.4402 0 48.2558V59.5223C0 63.0117 2.8388 65.8505 6.32812 65.8505H65.6719C69.1612 65.8505 72 63.0117 72 59.5223V48.2558C72 42.4402 67.2687 37.7089 61.4531 37.7089ZM19.2241 42.8459V61.6319H6.32812C5.16502 61.6319 4.21875 60.6856 4.21875 59.5225V48.2559C4.21875 44.7666 7.05755 41.9278 10.5469 41.9278H17.5947C18.1673 41.9278 18.7218 42.0055 19.2497 42.1488C19.2336 42.3808 19.225 42.6133 19.2241 42.8459ZM48.5571 61.6319H23.4429V42.8458C23.4429 39.3564 26.2817 36.5176 29.771 36.5176H42.229C45.7183 36.5176 48.5571 39.3564 48.5571 42.8458V61.6319ZM67.7812 59.5225C67.7812 60.6856 66.835 61.6319 65.6719 61.6319H52.7759V42.8458C52.775 42.6132 52.7664 42.3807 52.7503 42.1487C53.2897 42.0021 53.8463 41.9277 54.4053 41.9276H61.4531C64.9425 41.9276 67.7812 44.7664 67.7812 48.2558V59.5225Z' fill='#3E64F4' /> <path d='M14.0713 17.7896C8.90348 17.7896 4.69922 21.9939 4.69922 27.1617C4.69908 32.3295 8.90348 36.5338 14.0713 36.5338C19.239 36.5338 23.4434 32.3295 23.4434 27.1617C23.4434 21.9939 19.2391 17.7896 14.0713 17.7896ZM14.0712 32.3151C11.2296 32.3151 8.91783 30.0033 8.91783 27.1617C8.91783 24.3201 11.2296 22.0084 14.0712 22.0084C16.9128 22.0084 19.2245 24.3201 19.2245 27.1617C19.2245 30.0033 16.9128 32.3151 14.0712 32.3151ZM36.0004 6.14939C29.0963 6.14939 23.4794 11.7662 23.4794 18.6704C23.4794 25.5745 29.0963 31.1913 36.0004 31.1913C42.9045 31.1913 48.5213 25.5745 48.5213 18.6704C48.5213 11.7664 42.9045 6.14939 36.0004 6.14939ZM36.0004 26.9726C31.4225 26.9726 27.6982 23.2483 27.6982 18.6704C27.6982 14.0926 31.4225 10.3681 36.0004 10.3681C40.5783 10.3681 44.3026 14.0925 44.3026 18.6704C44.3026 23.2483 40.5783 26.9726 36.0004 26.9726ZM57.9294 17.7896C52.7618 17.7896 48.5574 21.9939 48.5574 27.1617C48.5575 32.3295 52.7618 36.5338 57.9294 36.5338C63.0973 36.5338 67.3015 32.3295 67.3015 27.1617C67.3015 21.9939 63.0973 17.7896 57.9294 17.7896ZM57.9294 32.3151C55.088 32.3151 52.7761 30.0033 52.7761 27.1617C52.7762 24.3201 55.088 22.0084 57.9294 22.0084C60.7711 22.0084 63.0828 24.3201 63.0828 27.1617C63.0828 30.0033 60.7711 32.3151 57.9294 32.3151Z' fill='#3E64F4' />{' '}
                    </svg>
                ),
            },
            {
                path: '/evaluate/banks',
                title: 'تقييم السيارات للبنوك',
                icon: (
                    <svg width='72' height='72' viewBox='0 0 72 72' fill='none' xmlns='http://www.w3.org/2000/svg'>
                        {' '}
                        <g clipPath='url(#clip0_2418_5722)'>
                            {' '}
                            <path d='M35.996 9.81497C32.3844 9.81497 29.4473 12.7521 29.4473 16.3637C29.4473 19.9753 32.3844 22.9123 35.996 22.9123C39.6076 22.9123 42.5446 19.9751 42.5446 16.3637C42.5446 12.7523 39.6074 9.81497 35.996 9.81497ZM35.996 19.6396C34.1902 19.6396 32.7201 18.1695 32.7201 16.3637C32.7201 14.5579 34.1902 13.0878 35.996 13.0878C37.8018 13.0878 39.2719 14.5579 39.2719 16.3637C39.2719 18.1695 37.8018 19.6396 35.996 19.6396Z' fill='#3E64F4' /> <path d='M70.3637 29.4545C71.2682 29.4545 72.0002 28.7271 72.0002 27.8227V21.278C72.0002 20.7012 71.6966 20.1659 71.1995 19.8718L39.1896 0.86228C39.1752 0.852615 39.1608 0.844638 39.1465 0.83666C37.1569 -0.265891 34.9133 -0.299335 32.8087 0.859058L0.800643 19.8718C0.556551 20.0165 0.35435 20.2222 0.213958 20.4688C0.0735661 20.7154 -0.000174356 20.9942 3.09569e-07 21.278V27.8227C3.09569e-07 28.7271 0.731916 29.4545 1.63642 29.4545H6.54551V58.9105C2.93549 58.9105 3.09569e-07 61.8456 3.09569e-07 65.4552V70.3639C-0.000120707 70.5788 0.042125 70.7916 0.124322 70.9902C0.206518 71.1888 0.327054 71.3692 0.479035 71.5212C0.631016 71.6732 0.811463 71.7937 1.01006 71.8758C1.20865 71.958 1.42149 72.0003 1.63642 72.0001H70.3637C70.5787 72.0003 70.7915 71.958 70.9901 71.8758C71.1887 71.7937 71.3691 71.6732 71.5211 71.5212C71.6731 71.3692 71.7936 71.1888 71.8758 70.9902C71.958 70.7916 72.0003 70.5788 72.0002 70.3639V65.4552C72.0002 61.8456 69.0647 58.9105 65.4547 58.9105V29.4545H70.3637ZM68.7273 65.4546V68.7273H3.27268V65.4546C3.27268 63.6505 4.74127 62.1819 6.54536 62.1819H65.4547C67.2587 62.1818 68.7273 63.6504 68.7273 65.4546ZM9.81819 58.9091V29.4545H16.3637V58.9091H9.81819ZM19.6364 58.9091V29.4545H29.4546V58.9091H19.6364ZM32.7272 58.9091V29.4545H39.2728V58.9091H32.7272ZM42.5454 58.9091V29.4545H52.3636V58.9091H42.5454ZM55.6365 58.9091V29.4545H62.182V58.9091H55.6365ZM3.27268 26.1819V22.2044L34.4324 3.69299C35.452 3.13212 36.5353 3.13366 37.5421 3.68179L68.7273 22.2044V26.1819H3.27268Z' fill='#3E64F4' />{' '}
                        </g>{' '}
                        <defs>
                            {' '}
                            <clipPath id='clip0_2418_5722'>
                                {' '}
                                <rect width='72' height='72' fill='white' />{' '}
                            </clipPath>{' '}
                        </defs>{' '}
                    </svg>
                ),
            },
            {
                path: '/evaluate/companies',
                title: 'تقييم السيارات للشركات',
                icon: (
                    <svg width='72' height='72' viewBox='0 0 72 72' fill='none' xmlns='http://www.w3.org/2000/svg'>
                        {' '}
                        <path d='M66.5996 63H59.3996V12.6C59.3996 12.1226 59.21 11.6648 58.8724 11.3272C58.5348 10.9896 58.077 10.8 57.5996 10.8H52.1996V5.4C52.1996 4.92261 52.01 4.46477 51.6724 4.12721C51.3348 3.78964 50.877 3.6 50.3996 3.6H21.5996C21.1222 3.6 20.6644 3.78964 20.3268 4.12721C19.9893 4.46477 19.7996 4.92261 19.7996 5.4V10.8H14.3996C13.9222 10.8 13.4644 10.9896 13.1268 11.3272C12.7893 11.6648 12.5996 12.1226 12.5996 12.6V63H5.39961C4.92222 63 4.46438 63.1896 4.12682 63.5272C3.78925 63.8648 3.59961 64.3226 3.59961 64.8C3.59961 65.2774 3.78925 65.7352 4.12682 66.0728C4.46438 66.4104 4.92222 66.6 5.39961 66.6H66.5996C67.077 66.6 67.5348 66.4104 67.8724 66.0728C68.21 65.7352 68.3996 65.2774 68.3996 64.8C68.3996 64.3226 68.21 63.8648 67.8724 63.5272C67.5348 63.1896 67.077 63 66.5996 63ZM23.3996 7.2H48.5996V10.8H23.3996V7.2ZM26.9996 63V52.2H34.1996V63H26.9996ZM37.7996 63V52.2H44.9996V63H37.7996ZM48.5996 63V50.4C48.5996 49.9226 48.41 49.4648 48.0724 49.1272C47.7348 48.7896 47.277 48.6 46.7996 48.6H25.1996C24.7222 48.6 24.2644 48.7896 23.9268 49.1272C23.5892 49.4648 23.3996 49.9226 23.3996 50.4V63H16.1996V14.4H55.7996V63H48.5996ZM52.1996 21.6C52.1996 22.0774 52.01 22.5352 51.6724 22.8728C51.3348 23.2104 50.877 23.4 50.3996 23.4H43.1996C42.7222 23.4 42.2644 23.2104 41.9268 22.8728C41.5892 22.5352 41.3996 22.0774 41.3996 21.6C41.3996 21.1226 41.5892 20.6648 41.9268 20.3272C42.2644 19.9896 42.7222 19.8 43.1996 19.8H50.3996C50.877 19.8 51.3348 19.9896 51.6724 20.3272C52.01 20.6648 52.1996 21.1226 52.1996 21.6ZM30.5996 21.6C30.5996 22.0774 30.41 22.5352 30.0724 22.8728C29.7348 23.2104 29.277 23.4 28.7996 23.4H21.5996C21.1222 23.4 20.6644 23.2104 20.3268 22.8728C19.9893 22.5352 19.7996 22.0774 19.7996 21.6C19.7996 21.1226 19.9893 20.6648 20.3268 20.3272C20.6644 19.9896 21.1222 19.8 21.5996 19.8H28.7996C29.277 19.8 29.7348 19.9896 30.0724 20.3272C30.41 20.6648 30.5996 21.1226 30.5996 21.6ZM52.1996 30.6C52.1996 31.0774 52.01 31.5352 51.6724 31.8728C51.3348 32.2104 50.877 32.4 50.3996 32.4H43.1996C42.7222 32.4 42.2644 32.2104 41.9268 31.8728C41.5892 31.5352 41.3996 31.0774 41.3996 30.6C41.3996 30.1226 41.5892 29.6648 41.9268 29.3272C42.2644 28.9896 42.7222 28.8 43.1996 28.8H50.3996C50.877 28.8 51.3348 28.9896 51.6724 29.3272C52.01 29.6648 52.1996 30.1226 52.1996 30.6ZM30.5996 30.6C30.5996 31.0774 30.41 31.5352 30.0724 31.8728C29.7348 32.2104 29.277 32.4 28.7996 32.4H21.5996C21.1222 32.4 20.6644 32.2104 20.3268 31.8728C19.9893 31.5352 19.7996 31.0774 19.7996 30.6C19.7996 30.1226 19.9893 29.6648 20.3268 29.3272C20.6644 28.9896 21.1222 28.8 21.5996 28.8H28.7996C29.277 28.8 29.7348 28.9896 30.0724 29.3272C30.41 29.6648 30.5996 30.1226 30.5996 30.6ZM52.1996 39.6C52.1996 40.0774 52.01 40.5352 51.6724 40.8728C51.3348 41.2104 50.877 41.4 50.3996 41.4H43.1996C42.7222 41.4 42.2644 41.2104 41.9268 40.8728C41.5892 40.5352 41.3996 40.0774 41.3996 39.6C41.3996 39.1226 41.5892 38.6648 41.9268 38.3272C42.2644 37.9896 42.7222 37.8 43.1996 37.8H50.3996C50.877 37.8 51.3348 37.9896 51.6724 38.3272C52.01 38.6648 52.1996 39.1226 52.1996 39.6ZM30.5996 39.6C30.5996 40.0774 30.41 40.5352 30.0724 40.8728C29.7348 41.2104 29.277 41.4 28.7996 41.4H21.5996C21.1222 41.4 20.6644 41.2104 20.3268 40.8728C19.9893 40.5352 19.7996 40.0774 19.7996 39.6C19.7996 39.1226 19.9893 38.6648 20.3268 38.3272C20.6644 37.9896 21.1222 37.8 21.5996 37.8H28.7996C29.277 37.8 29.7348 37.9896 30.0724 38.3272C30.41 38.6648 30.5996 39.1226 30.5996 39.6Z' fill='#3E64F4' />{' '}
                    </svg>
                ),
            },
            {
                path: '',
                title: 'المزادات',
                icon: (
                    <svg width='72' height='72' viewBox='0 0 72 72' fill='none' xmlns='http://www.w3.org/2000/svg'>
                        {' '}
                        <g clipPath='url(#clip0_2418_142)'>
                            {' '}
                            <path d='M70.0867 61.2008L47.4199 38.4081C48.5428 36.0554 48.1328 33.1478 46.1872 31.202C45.6792 30.6936 45.0879 30.2759 44.439 29.967L47.2194 27.1866C49.4247 27.9922 52.043 27.5435 53.8703 25.7164C56.3436 23.2432 56.344 19.2402 53.8703 16.7666L38.954 1.85062C36.4866 -0.616924 32.4716 -0.616783 30.0042 1.85062C27.8798 3.97476 27.6114 7.17778 29.0408 9.56644L9.63372 28.9735C7.20485 27.5268 4.00802 27.8468 1.9196 29.9353C-0.553717 32.4084 -0.554139 36.4116 1.9196 38.8851L16.8357 53.8012C19.3089 56.2745 23.312 56.2747 25.7855 53.8012H25.7856C27.5799 52.0068 28.0678 49.3945 27.2523 47.1537L30.0359 44.37C30.3448 45.0189 30.7625 45.6102 31.2708 46.1182C33.2008 48.0482 36.0967 48.4827 38.4677 47.3555L61.1331 70.1464C63.6007 72.614 67.6154 72.6137 70.0828 70.1464C72.5808 67.6484 72.5291 63.6429 70.0867 61.2008ZM32.9875 4.83384C33.81 4.01147 35.1483 4.01133 35.9708 4.83384L50.8868 19.7501C51.7112 20.5746 51.7111 21.909 50.8868 22.7333C50.0624 23.5576 48.728 23.5578 47.9035 22.7333L32.9875 7.8172C32.1649 6.99454 32.1649 5.65636 32.9875 4.83384ZM22.802 50.8179C21.9778 51.6423 20.6432 51.6424 19.8188 50.8179L4.90267 35.9018C4.07819 35.0774 4.07819 33.7431 4.90267 32.9186C5.72533 32.0961 7.06338 32.0962 7.88603 32.9186L22.802 47.8347C23.6246 48.6572 23.6246 49.9956 22.802 50.8179ZM24.6868 43.7529L12.7538 31.8199L31.8889 12.6849L43.8218 24.618L24.6868 43.7529ZM37.2416 43.131L37.2376 43.135C36.4149 43.9575 35.0769 43.9574 34.2542 43.135C33.43 42.3108 33.4296 40.977 34.2538 40.1522L40.2206 34.1854C41.0436 33.3624 42.382 33.3634 43.2039 34.1854C44.0264 35.0079 44.0264 36.3462 43.204 37.1686L37.2416 43.131ZM41.7082 44.6309L44.6915 41.6475L59.6622 56.7014L56.679 59.6846L41.7082 44.6309ZM67.0996 67.1632C66.2769 67.9856 64.9387 67.9857 64.1204 67.1674L59.6539 62.6761L62.6371 59.6929L67.0996 64.1801C67.9242 65.0045 67.9242 66.3387 67.0996 67.1632Z' fill='#3E64F4' /> <path d='M44.3731 67.7811H42.0513C41.0715 62.9727 36.8098 59.3433 31.7162 59.3433H14.8405C9.74697 59.3433 5.48547 62.9727 4.50545 67.7811H2.18373C1.0188 67.7811 0.0742188 68.7255 0.0742188 69.8906C0.0742188 71.0556 1.01866 72.0001 2.18373 72.0001H44.3729C45.5379 72.0001 46.4824 71.0557 46.4824 69.8906C46.4824 68.7255 45.538 67.7811 44.3731 67.7811ZM8.87355 67.7811C9.74416 65.3255 12.0902 63.5622 14.8405 63.5622H31.7162C34.4666 63.5622 36.8125 65.3255 37.6833 67.7811H8.87355Z' fill='#3E64F4' />{' '}
                        </g>{' '}
                        <defs>
                            {' '}
                            <clipPath id='clip0_2418_142'>
                                {' '}
                                <rect width='72' height='72' fill='white' />{' '}
                            </clipPath>{' '}
                        </defs>{' '}
                    </svg>
                ),
            },
        ],
    },

    people: {
        breadCrumbs: ['الرئيسية', 'تقييم السيارات للأفراد'],
        depart: ['معلومات العميل', 'معلومات السيارة', 'مواصفات السيارة'],
        termsConditions: 'الشروط والأحكام.',
        distance: [
            { id: '10000', title: '0 إلى 10,000 كم' },
            { id: '20000', title: '10,001 إلى 20,000 كم' },
            { id: '40000', title: '20,001 إلى 40,000 كم' },
            { id: '60000', title: '40,001 إلى 60,000 كم' },
            { id: '80000', title: '60,001 إلى 80,000 كم' },
            { id: '100000', title: '80,001 إلى 100,000 كم' },
            { id: '130000', title: '100,001 إلى 130,000 كم' },
            { id: '160000', title: '130,001 إلى 160,000 كم' },
            { id: '200000', title: '160,001 إلى 200,000 كم' },
        ],
        boxes: [
            { label: 'الاسم الكامل', place: 'أدخل الاسم الكامل' },
            { label: 'البريد الإلكتروني', place: 'أدخل البريد الإلكتروني' },
            { label: 'رقم الهاتف', place: 'أدخل رقم الهاتف' },
            { label: 'المنطقة', place: 'اختر الدولة' },
            { label: 'المدينة', place: 'اختر المدينة' },
            {
                label: 'غرض التقييم',
                choose: [
                    { name: 'تحديد قيمة السيارة', value: 'تحديد قيمة السيارة' },
                    { name: 'الأغراض التجارية', value: 'الأغراض التجارية' },
                    { name: 'بيع السيارة', value: 'بيع السيارة' },
                ],
            },
        ],
        boxes2: [
            { label: 'ماركة السيارة', place: 'اختر الماركة' },
            { label: 'اسم الموديل', place: 'اختر الموديل' },
            { label: 'سنة الصنع', place: 'اختر سنة الصنع' },
            {
                label: 'حالة السيارة',
                place: 'اختر حالة السيارة',
                choose: [
                    { id: 0, title: 'ممتازه' },
                    { id: 1, title: 'جيده' },
                    { id: 2, title: 'مقبوله' },
                ],
            },
            {
                label: 'حالة المحرك',
                place: 'اختر حالة المحرك',
                choose: [
                    { id: 0, title: 'ممتازه' },
                    { id: 1, title: 'مقبوله' },
                ],
            },
            {
                label: 'حالة الجيربوكس',
                place: 'اختر حالة الجيربوكس',
                choose: [
                    { id: 0, title: 'ممتازه' },
                    { id: 1, title: 'مقبوله' },
                ],
            },
            { label: 'المسافة المقطوعة', place: 'اختر المسافة المقطوعة' },
            { label: 'السعر الحالي للسيارة الجديدة', place: 'السعر بالريال السعودي' },
            {
                label: 'هل يوجد طلاء ناتج عن حوادث؟',
                choose: [
                    { name: 'نعم', value: 'yes' },
                    { name: 'لا', value: 'no' },
                ],
            },
        ],
        rights: ['الشروط والأحكام', 'بالنقر هنا، أقر بأنني قد قرأت وفهمت '],
        button: ['إرسال طلب استفسار', 'جاري إرسال طلب الاستفسار'],
        car: ['يرجى تحديد الأجزاء', 'الجانب الأيمن', 'الجانب الأيسر', 'الجزء العلوي'],
        parts: [
            { id: 1, name: 'الرفرف الأمامي الأيسر' },
            { id: 2, name: 'الرفرف الخلفي الأيسر' },
            { id: 3, name: 'المصد الأمامي' },
            { id: 4, name: 'المصد الخلفي' },
            { id: 5, name: 'الرفرف الأمامي الأيمن' },
            { id: 6, name: 'الرفرف الخلفي الأيمن' },
            { id: 7, name: 'الباب الخلفي الأيمن' },
            { id: 8, name: 'الباب الخلفي الأيسر' },
            { id: 9, name: 'الباب الأمامي الأيسر' },
            { id: 10, name: 'الباب الأمامي الأيمن' },
            { id: 11, name: 'غطاء المحرك' },
            { id: 12, name: 'غطاء الصندوق الخلفي' },
            { id: 13, name: 'السقف' },
        ],
        schema: {
            name: 'الاسم مطلوب.',
            email: 'البريد الإلكتروني مطلوب ويجب أن يكون صحيحا.',
            phone: 'رقم الهاتف مطلوب.',
            country: 'الدولة مطلوبة.',
            city: 'المدينة مطلوبة.',
            purpose: 'غرض التقييم مطلوب.',
            brand: 'ماركة السيارة مطلوبة.',
            model: 'موديل السيارة مطلوب.',
            date: 'سنة الصنع مطلوبة.',
            status: 'حالة السيارة مطلوبة.',
            price: 'السعر الحالي للسيارة الجديدة مطلوب.',
            distance: 'المسافة المقطوعة مطلوبة.',
            pieces: 'عدد الأجزاء مطلوب.',
            spray: 'معلومات عما إذا كان هناك طلاء نتيجة حوادث مطلوبة.',
            details: 'تفاصيل إضافية مطلوبة.',
            rights: 'يجب الموافقة على الشروط والأحكام.',
            motor: 'يجب تحديد حالة المحرك.',
            gyripx: 'يجب تحديد حالة ناقل الحركة.',
        },
        notification: 'تم إرسال معلوماتك.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
    },
    banks: {
        breadCrumbs: ['الرئيسية', 'تقييم السيارات للبنوك'],
        depart: ['معلومات البنك', 'معلومات السيارة'],
        boxes: [
            { label: 'اسم البنك', place: 'أدخل اسم البنك' },
            { label: 'رقم الهاتف', place: 'أدخل رقم الهاتف' },
            { label: 'المنطقة', place: 'اختر المنطقة' },
            { label: 'المدينة', place: 'اختر المدينة' },
            { label: 'العنوان', place: 'أدخل العنوان' },
            { label: 'الرمز البريدي', place: 'أدخل الرمز البريدي' },
            { label: 'صندوق البريد', place: 'أدخل رقم صندوق البريد' },
            { label: 'اسم الموظف أو ممثل البنك', place: 'أدخل اسم الموظف أو ممثل البنك' },
            { label: 'المسمى الوظيفي', place: 'أدخل المسمى الوظيفي' },
        ],
        ul: ['تحميل ملف معلومات السيارة', 'تحميل الملف', 'إعادة رفع الملف', 'تُحذف البيانات كل 120 يومًا'],
        button: ['إرسال طلب استفسار', 'جاري إرسال طلب الاستفسار'],
        schema: {
            name: 'الاسم مطلوب.',
            phone: 'رقم الهاتف مطلوب.',
            country: 'الدولة مطلوبة.',
            city: 'المدينة مطلوبة.',
            address: 'العنوان مطلوب.',
            Zcode: 'الرمز البريدي مطلوب.',
            Bcode: 'صندوق البريد مطلوب.',
            person: 'الشخص المسؤول مطلوب.',
            position: 'المسمى الوظيفي مطلوب.',
        },
        notification: 'تم إرسال معلوماتك.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
    },

    companies: {
        breadCrumbs: ['الرئيسية', 'تقييم السيارات للشركات'],
        depart: ['معلومات الشركة', 'معلومات السيارة'],
        boxes: [
            { label: 'الاسم الكامل', place: 'أدخل الاسم الكامل' },
            { label: 'رقم الهاتف', place: 'أدخل رقم الهاتف' },
            { label: 'المنطقة', place: 'اختر المنطقة' },
            { label: 'المدينة', place: 'اختر المدينة' },
            { label: 'العنوان', place: 'أدخل العنوان' },
            { label: 'الرمز البريدي', place: 'أدخل الرمز البريدي' },
            { label: 'صندوق البريد', place: 'أدخل رقم صندوق البريد' },
            { label: 'الشخص المسؤول', place: 'أدخل الشخص المسؤول' },
            { label: 'المسمى الوظيفي', place: 'أدخل المسمى الوظيفي' },
            {
                label: 'نوع نشاط الشركة',
                place: [
                    { value: 'وكالات السيارات', name: 'وكالات السيارات' },
                    { value: 'شركات تمويل السيارات', name: 'شركات تمويل السيارات' },
                    { value: 'أخرى', name: 'أخرى' },
                ],
            },
        ],
        ul: ['تحميل ملف معلومات السيارة', 'تحميل الملف', 'إعادة رفع الملف', 'تُحذف البيانات كل 120 يومًا'],
        button: ['إرسال طلب استفسار', 'جاري إرسال طلب الاستفسار'],
        schema: {
            name: 'الاسم مطلوب.',
            position: 'المسمى الوظيفي مطلوب.',
            active: 'نوع نشاط الشركة مطلوب.',
            phone: 'رقم الهاتف مطلوب.',
            city: 'المدينة مطلوبة.',
            country: 'الدولة مطلوبة.',
            address: 'العنوان مطلوب.',
            Zcode: 'الرمز البريدي مطلوب.',
            Bcode: 'رقم صندوق البريد مطلوب.',
            person: 'الشخص المسؤول مطلوب.',
        },
        notification: 'تم إرسال معلوماتك.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
    },
    numbers: {
        breadCrumbs: ['الرئيسية', 'سومها  بالأرقام'],
        h1: 'مستقبل سومها',
        h2: 'معكم، سنصل إلى مكان يجمع كل شيء يتعلق بالسيارات. تابعوا كل جديد',
        box: [{ title: 'عدد السيارات المقيّمة' }, { title: 'تقييم السيارات للأفراد' }, { title: 'تقييم السيارات للبنوك' }, { title: 'تقييم السيارات للشركات' }, { title: 'تقييم السيارات المبسط أو التفصيلي' }, { title: 'العملاء' }],
    },

    adds: {
        breadCrumbs: ['الرئيسية', 'للإعلانات الخاصة بك'],
        h1: 'يرجى تزويدنا بالمعلومات التالية حتى تتمكن الإدارة المعنية من التواصل معك',
        box: [
            { label: 'اسم الشركة', place: 'اسم الشركة' },
            { label: 'اسم المدير', place: 'اسم المدير' },
            { label: 'نوع النشاط', place: 'نوع النشاط' },
            { label: 'البريد الإلكتروني', place: 'أدخل البريد الإلكتروني' },
            { label: 'رقم الهاتف', place: 'أدخل رقم الهاتف' },
            { label: 'المدينة', place: 'اختر المدينة', select: ['الرياض', 'القاهرة', 'الإمارات'] },
            { label: 'المدينة', place: 'أدخل المدينة' },
        ],
        button: ['إرسال', 'جاري الإرسال'],
        notification: 'تم إرسال معلوماتك.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
        schema: {
            name: 'الاسم مطلوب.',
            position: 'اسم المدير مطلوب.',
            active: 'نوع النشاط مطلوب.',
            phone: 'رقم الهاتف مطلوب.',
            city: 'المدينة مطلوبة.',
            email: 'البريد الإلكتروني مطلوب ويجب أن يكون عنوان بريد إلكتروني صالحًا.',
        },
    },

    'contact-us': {
        breadCrumbs: ['الرئيسية', 'اتصل بنا'],
        h1: 'اتصل بنا',
        h2: 'أرسل أي استفسارات لديك وسيتواصل معك فريق سومها في أقرب وقت ممكن',
        box: [
            { label: 'الاسم', place: 'مثال: محمد إبراهيم محمود' },
            { label: 'البريد الإلكتروني', place: 'مثال: mohamed@example.com' },
            { label: 'الموضوع', place: 'مثال: أحدث عروض التقييم' },
            { label: 'الرسالة', place: 'اكتب رسالتك هنا...' },
        ],
        button: ['إرسال', 'جاري الإرسال'],
        notification: 'تم إرسال معلوماتك وسيتواصل معك أحد ممثلينا.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
        schema: {
            name: 'الاسم مطلوب',
            email: 'البريد الإلكتروني مطلوب',
            topic: 'الموضوع مطلوب',
            message: 'الرسالة مطلوبة',
        },
    },

    'my-account': {
        breadCrumbs: ['الرئيسية', 'حسابي'],
        box: [
            { label: 'البريد الإلكتروني', place: 'user@example.com' },
            { label: 'الهاتف أو الجوال', place: '' },
        ],
        links: ['تغيير كلمة المرور', 'نسيت كلمة المرور؟'],
        box_change: [
            { label: 'كلمة المرور الحالية', place: '****************' },
            { label: 'كلمة المرور الجديدة', place: '****************' },
            { label: 'تأكيد كلمة المرور الجديدة', place: '****************' },
        ],
        button: ['حفظ التغييرات', 'جاري حفظ التغييرات'],
        schema: {
            email: 'يرجى إدخال البريد الإلكتروني',
            phone: 'يرجى إدخال رقم الهاتف',
        },
        notification: 'تم إرسال معلوماتك.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
    },
    'my-notifications': {
        breadCrumbs: ['الرئيسية', 'الإشعارات'],
        data: [
            { res: 'تم الرد على طلب تقييم سيارتك', details: 'بخصوص فورد فوكس 2005', date: '20 مارس 2024' },
            { res: 'تم الرد على طلب تقييم سيارتك', details: 'بخصوص فورد فوكس 2005', date: '20 مارس 2024' },
            { res: 'تم الرد على طلب تقييم سيارتك', details: 'بخصوص فورد فوكس 2005', date: '20 مارس 2024' },
            { res: 'تم الرد على طلب تقييم سيارتك', details: 'بخصوص فورد فوكس 2005', date: '20 مارس 2024' },
            { res: 'تم الرد على طلب تقييم سيارتك', details: 'بخصوص فورد فوكس 2005', date: '20 مارس 2024' },
            { res: 'تهانينا! تم التحقق من حسابك بنجاح', date: '20 مارس 2024' },
        ],
        error: ['ليس لديك إشعارات في الوقت الحالي', 'العودة إلى الصفحة الرئيسية'],
    },

    'rate-us': {
        breadCrumbs: ['الرئيسية', 'قيمنا'],
        textarea: 'اكتب تعليقك هنا ....',
        button: ['إرسال التقييم', 'جاري إرسال التقييم', 'عرض التقييمات'],
        notification: 'تم إرسال معلوماتك.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
        schema: {
            comment: 'يرجى إرسال رسالتك.',
        },
    },

    rating: {
        breadCrumbs: ['الرئيسية', 'تقييماتنا'],
        depart: 'التقييمات',
        button: 'قيمنا',
        notFound: ['لا توجد تقييمات في الوقت الحالي', 'قم بتقييمنا'],
    },
    complains: {
        breadCrumbs: ['الرئيسية', 'الشكاوى والاقتراحات'],
        button: 'تقديم شكوى',
        notFound: ['لا توجد شكاوى واقتراحات في الوقت الحالي', 'أرسل شكوى'],
    },

    'send-complains': {
        breadCrumbs: ['الرئيسية', 'الشكاوى والاقتراحات', 'تقديم شكوى'],
        box: [{ label: 'الاسم', place: 'أدخل اسمك هنا' }, { label: 'البريد الإلكتروني', place: 'user@example.com' }, { place: 'اكتب شكواك هنا ....' }],
        button: ['تقديم شكوى', 'جاري تقديم الشكوى'],
        notification: 'تم إرسال معلوماتك.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
        schema: {
            name: 'يرجى إدخال اسمك',
            email: 'يرجى إدخال بريدك الإلكتروني',
            message: 'يرجى إدخال رسالتك',
        },
    },

    'all-news': {
        breadCrumbs: ['الرئيسية', 'الأخبار'],
        depart: ['أحدث الأخبار', 'الأكثر شعبية'],
        button: 'اقرأ المزيد',
    },
    'my-orders': {
        breadCrumbs: ['الرئيسية', 'طلباتي'],
        names: ['العلامة التجارية والموديل', 'سنة الصنع', 'حالة السيارة', 'سعر الشراء', 'عدد الكيلومترات', 'هل هناك أي أعمال دهان بسبب الحوادث أو الخدوش؟'],
        button: 'التسعير',
        currency: 'ريال سعودي',
        kilos: 'كيلومتر',
        error: ['ليس لديك أي طلبات حتى الآن', 'العودة إلى الصفحة الرئيسية', 'إلغاء الطلب'],
        order: 'تعديل الطلب',
        model: 'سنة الموديل',
        'not-reply': 'لم يتم الرد بعد',
        reply: 'تم الرد',
        price: 'السعر النهائي',
        scratches: ['يوجد', 'لا يوجد'],
    },

    modal: {
        title: 'إلغاء الطلب',
        desc: 'عند إلغاء الطلب، سيتم حذف جميع البيانات المتعلقة بطلبك. هل أنت متأكد أنك تريد المضي قدمًا في الإلغاء؟',
        cancel: 'تأكيد حذف الطلب',
        confirm: 'لا، لا تلغِ',
    },

    home: {
        // "imgs": [Img_1, Img_2, Img_3, Img_4],
        text: [
            { h1: 'قيمها قبل ان تذهب لسمسار يبخسها ', h2: 'الأفراد - البنوك - الشركات' },
            { h1: '', h2: 'الأفراد - البنوك - الشركات' },
            { h1: 'احصل على القيمة قبل ان تذهب غنيمه', h2: 'الأفراد - البنوك - الشركات' },
            { h1: '', h2: 'الأفراد - البنوك - الشركات' },
        ],
        btns: ['تقييم السيارات للشركات', 'تقييم السيارات للبنوك', 'تقييم السيارات للأفراد'],

        brand: ['سومها المستقبل', 'معكم، سنصل إلى مكان يجمع كل شيء عن السيارات. ترقبوا الجديد'],

        adds: 'لتقييم السيارات الفاخرة وتلك غير المدرجة في النظام، يرجى التواصل معنا عبر <b>(واتساب أو البريد الإلكتروني)</b>. سيتم التعامل مع المعلومات بسرية وخصوصية تامة. يرجى ملاحظة أن هذه الخدمة ستقدم بسعر مخفض لفترة محدودة.',

        news: ['الأخبار والفعاليات', 'ابقَ على اطلاع بأحدث الأخبار والفعاليات المتعلقة بسومها', 'اقرأ المزيد', 'عرض الكل'],

        common: ['الأسئلة الشائعة'],
    },
    footer: {
        dashboard: 'لوحه التحكم',
        logo: 'سومها',
        h1: 'احصل على سعر قبل الذهاب إلى وسيط يقوم بتقليل قيمته',
        h2: 'احصل على القيمة قبل أن تصبح غنيمة',
        h3: ['روابط سريعة', 'خدماتنا', 'سومها', 'تابعنا على'],
        names: [
            'الرئيسية',
            'سومها بالأرقام',
            'للإعلانات الخاصة بك',
            'باقات تقييم السيارات',
            'الأخبار والفعاليات',
            'الأسئلة الشائعة',
            'تقييم السيارات للأفراد',
            'تقييم السيارات للبنوك',
            'تقييم السيارات للشركات',
            'المزادات',
            'الشكاوى والاقتراحات',
            'تقييمنا',
            'اتصل بنا',
            'الإشعارات',
            'معلومات عنا', //14
            'الشروط والأحكام',
            'سياسة الخصوصية',
        ],
        rights: 'جميع الحقوق محفوظة 2020 © سومها.',
    },

    'sign-in': {
        depart: 'تسجيل الدخول',
        inputs: [
            { label: 'البريد الإلكتروني أو الهاتف', place: 'أدخل بريدك الإلكتروني أو هاتفك' },
            { label: 'كلمة المرور', place: 'أدخل كلمة المرور' },
        ],
        links: ['نسيت كلمة المرور؟', 'تسجيل الدخول', 'جاري تسجيل الدخول', 'ليس لديك حساب؟', 'أنشئ حسابًا جديدًا'],
        schema: {
            email: 'يرجى إدخال بريدك الإلكتروني',
            password: 'يرجى إدخال كلمة المرور',
        },
        notification: 'تم تسجيل الدخول بنجاح.',
        notification_err: 'فشل تسجيل الدخول. يرجى التحقق من بريدك الإلكتروني وكلمة المرور.',
    },

    'sign-up': {
        depart: 'إنشاء حساب جديد',
        inputs: [
            { label: 'البريد الإلكتروني', place: 'أدخل بريدك الإلكتروني' },
            { label: 'الهاتف', place: 'أدخل رقم هاتفك' },
            { label: 'كلمة المرور', place: 'أدخل كلمة المرور' },
            { label: 'تأكيد كلمة المرور', place: 'أدخل تأكيد كلمة المرور' },
        ],
        links: ['إنشاء حساب جديد', 'جاري إنشاء حساب جديد', 'هل لديك حساب بالفعل؟', 'تسجيل الدخول'],
        schema: {
            email: 'يرجى إدخال بريدك الإلكتروني',
            phone: 'يرجى إدخال رقم هاتفك',
            password: 'يرجى إدخال كلمة المرور',
            confirmPassword: 'يرجى تأكيد كلمة المرور',
        },
        notification: 'تم التسجيل بنجاح.',
        notification_err: 'فشل التسجيل. يرجى التحقق من المعلومات المدخلة.',
    },

    'enter-email': {
        depart: 'نسيت كلمة المرور؟',
        p: 'أدخل عنوان بريدك الإلكتروني وستتلقى رسالة لإعادة تعيين كلمة المرور الخاصة بك.',
        field: ['البريد الإلكتروني', 'أدخل عنوان بريدك الإلكتروني', 'إرسال رمز إعادة تعيين كلمة المرور', 'جاري إرسال رمز إعادة تعيين كلمة المرور'],

        schema: {
            'password-min-length': 'يجب أن تكون كلمة المرور مكونة من 6 أحرف على الأقل.',
            'confirmPassword-match': 'يجب أن تتطابق كلمة المرور مع تأكيد كلمة المرور.',
            email: 'يرجى إدخال عنوان بريدك الإلكتروني.',
            otp: 'يرجى إدخال كلمة المرور لمرة واحدة (OTP) المرسلة إلى بريدك الإلكتروني.',
            password: 'يرجى إدخال كلمة المرور الجديدة.',
            confirmPassword: 'يرجى تأكيد كلمة المرور الجديدة.',
        },
        notification: 'تمت معالجة طلبك بنجاح. تحقق من بريدك الإلكتروني للحصول على رمز إعادة تعيين كلمة المرور.',
        notification_err: 'يرجى إعادة إرسال البيانات.',
    },
    otp: {
        depart: 'كلمة مرور جديدة؟',
        field: [
            { label: 'أدخل رمز OTP', place: 'أدخل رمز OTP' },
            { label: 'كلمة المرور الجديدة', place: 'كلمة المرور الجديدة' },
            { label: 'تأكيد كلمة المرور الجديدة', place: 'تأكيد كلمة المرور الجديدة' },
        ],
        button: ['إنشاء كلمة مرور جديدة', 'جاري إنشاء كلمة مرور جديدة'],
        notification: 'تمت معالجة طلبك بنجاح. تحقق من بريدك الإلكتروني للحصول على رابط إعادة تعيين كلمة المرور.',
        notification_err: 'يرجى إعادة إرسال البيانات',
        message_success: 'تم إرسال الرسالة إلى الرقم المقدم. يرجى التحقق من رسائلك وإدخال رمز التحقق (OTP) للمتابعة. شكرًا لك!',
        button_success: 'تسجيل الدخول',
    },

    breadCrumbs: ['الرئيسية', 'الأسئلة الشائعة'],

    'info-card': {
        h1: 'مراجعة الطلب',
        info: 'ملف معلومات السيارة',
        left: ['العلامة التجارية والموديل', 'سنة الصنع', 'حالة السيارة', 'السعر الحالي للسيارة الجديدة', 'عدد الكيلومترات', 'هل هناك أي أعمال رش أو حوادث أو خدوش على السيارة؟', 'عدد الأجزاء', 'السعر النهائي للسيارة'],
        right: ['سعر الخدمة', 'ضريبة القيمة المضافة 15%', 'الإجمالي قبل الخصم', 'الإجمالي بعد الخصم'],
        discount: ['رمز القسيمة', 'أدخل القسيمة', 'تطبيق', 'تم تطبيق القسيمة!'],
        banks: ['لديك', 'سيارات متبقية في الباقة.'],
        btn: 'تأكيد الطلب',
        spry: ['نعم', 'لا'],
    },

    offers: {
        breadCrumbs: ['الرئيسية', 'باقة تقييم السيارات'],
        h1: 'الباقة الحالية',
        h2: 'باقات إخري',
        between: ['تقييم', 'سيارات', 'ريال سعودي'],
        button: 'اشتر الآن',
        one: ['باقة تقييم السيارات', '150 ريال سعودي', 'تقييم 50 سيارة', 'السيارات المتبقية'],
        login: 'يجب عليك تسجيل الدخول أولاً!',
        subscribe: 'لقد قمت بالاشتراك في الباقة',
        youAreNotSubscribed: 'أنت غير مشترك في أي باقة',
    },

    alert: ['للوصول إلى هذه الصفحة، يجب عليك تسجيل الدخول أولاً. يرجى تسجيل الدخول للمتابعة أو التسجيل إذا لم يكن لديك حساب بعد.', 'تسجيل الدخول', 'إلغاء'],

    success: {
        h1: ' تم إرسال التقييم إلى بريدك الإلكتروني.',
        p: ' إذا كان لديك أي استفسارات، الرجاء التواصل مع فريق الدعم الخاص بنا',
        btn: 'العودة إلى الصفحة الرئيسية',
        final_price: 'السعر النهائي الخاص بك هو:',
        error: 'نعتذر، لم نتمكن من معالجة دفعتك. يرجى المحاولة مرة أخرى أو الاتصال بالدعم إذا استمرت المشكلة.',
        'contact-us': {
            success: 'تمت إضافة البيانات بنجاح.',
        },
    },

    settings: {
        privacy: ['الرئيسية', 'سياسة الخصوصية'],
        aboutUs: ['الرئيسية', 'معلومات عنا'],
        terms: ['الرئيسية', 'الشروط والأحكام'],
    },
};
